In [1]:
import os
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from IPython.core.display import display, HTML
sns.set()
%matplotlib inline

In [2]:
pd.options.display.max_columns = None
display(HTML("<style>.container { width:100% !important; }</style>"))
pd.set_option('display.float_format',lambda x: '%.4f' % x)

In [4]:
CSV_PATH = os.path.join('data', 'weather', 'chicago_hist.csv')
chi = pd.read_csv(CSV_PATH, encoding='latin1', parse_dates=['DATE']) 
chi.head()

,STATION,NAME,DATE,CDSD,DSND,DSNW,EMNT,EMSD,EMSN,EMXP,EMXT,HDSD,PRCP,SNOW,TAVG,TMAX,TMIN
0,USC00111577,"CHICAGO MIDWAY AIRPORT 3 SW, IL US",1928-03-01,nan,1.0000,2.0000,8.0000,1.0000,4.2000,0.3600,77.0000,nan,1.3900,6.0000,36.2000,44.8000,27.5000
1,USC00111577,"CHICAGO MIDWAY AIRPORT 3 SW, IL US",1928-04-01,nan,0.0000,0.0000,21.0000,0.0000,0.6000,0.9000,74.0000,nan,2.0100,0.7000,44.0000,53.7000,34.2000
2,USC00111577,"CHICAGO MIDWAY AIRPORT 3 SW, IL US",1928-05-01,nan,0.0000,0.0000,31.0000,0.0000,0.0000,0.7600,89.0000,nan,1.6900,0.0000,58.2000,70.1000,46.2000
3,USC00111577,"CHICAGO MIDWAY AIRPORT 3 SW, IL US",1928-06-01,nan,0.0000,0.0000,41.0000,0.0000,0.0000,2.5600,87.0000,nan,6.6400,0.0000,63.0000,72.9000,53.0000
4,USC00111577,"CHICAGO MIDWAY AIRPORT 3 SW, IL US",1928-11-01,nan,0.0000,0.0000,19.0000,0.0000,0.1000,1.2900,68.0000,nan,4.0600,0.1000,40.6000,47.2000,33.9000

In [6]:
temp_chi = chi[['DATE', 'TAVG', 'NAME']]
temp_chi.head()

        DATE    TAVG                                NAME
0 1928-03-01 36.2000  CHICAGO MIDWAY AIRPORT 3 SW, IL US
1 1928-04-01 44.0000  CHICAGO MIDWAY AIRPORT 3 SW, IL US
2 1928-05-01 58.2000  CHICAGO MIDWAY AIRPORT 3 SW, IL US
3 1928-06-01 63.0000  CHICAGO MIDWAY AIRPORT 3 SW, IL US
4 1928-11-01 40.6000  CHICAGO MIDWAY AIRPORT 3 SW, IL US

In [7]:
temp_chi = temp_chi.pivot(index='DATE', columns='NAME')
temp_chi.head()

                                         TAVG                            \
NAME       CHICAGO MIDWAY AIRPORT 3 SW, IL US CHICAGO UNIVERSITY, IL US
DATE
1893-11-01                                nan                       nan
1893-12-01                                nan                       nan
1894-01-01                                nan                       nan
1894-02-01                                nan                       nan
1894-03-01                                nan                       nan


NAME       CHICAGO WEATHER BUREAU CITY 2, IL US JOLIET, IL US
DATE
1893-11-01                                  nan       37.9000
1893-12-01                                  nan       28.5000
1894-01-01                                  nan       30.7000
1894-02-01                                  nan       24.7000
1894-03-01                                  nan       45.6000

I pulled in data from 4 separate weather stations around Chicago. Chicago is not large enough that there will be massive monthly temperature differences between different weather stations in the city, and all weather stations in the NOAA database are reputable (ie calibrate their instruments, so same-year comparisons should have the same accuracy, and measurements shouldn't be off by more than 1 degree F.

In [9]:
temp_chi = temp_chi.mean(axis=1)

In [10]:
temp_chi.head()

DATE
1893-11-01   37.9000
1893-12-01   28.5000
1894-01-01   30.7000
1894-02-01   24.7000
1894-03-01   45.6000
dtype: float64